#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.us-east-1.data.aws_ami.ubuntu2004: Reading...
module.us-east-1.module.platform.module.ansible_server.data.aws_caller_identity.current: Reading...
module.us-east-1.module.platform.data.aws_route53_zone.ktech_public: Reading...
module.us-east-1.data.aws_availability_zones.az_zones: Reading...
module.us-east-1.module.platform.module.grafana_dashboards.module.grafana_rds.module.db_instance.data.aws_partition.current: Reading...
module.us-east-1.module.platform.module.grafana_dashboards.module.grafana_rds.module.db_instance.data.aws_partition.current: Read complete after 0s [id=aws]
module.us-east-1.data.aws_ami.amazon_linux_2: Reading...
module.us-east-1.module.platform.module.grafana_dashboards.module.grafana_rds.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Reading...
module.us-east-1.module.platform.module.grafana_dashboards.module.grafana_rds.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Read complete after 0s [id=1813475199]
module.us-east-1.module.platform.module.grafana_dashboards.data.aws_db_snapshot.db_snapshot: Reading...
module.us-east-1.data.aws_ami.ubuntu2004: Read complete after 0s [id=ami-079ca844e323047c2]
module.us-east-1.data.aws_availability_zones.az_zones: Read complete after 0s [id=us-east-1]
module.us-east-1.module.platform.module.ansible_server.data.aws_caller_identity.current: Read complete after 0s [id=023093918714]
module.us-east-1.module.platform.module.grafana_dashboards.data.aws_db_snapshot.db_snapshot: Read complete after 0s [id=final-grafana-rds-dev-fa17a031]
module.us-east-1.data.aws_ami.amazon_linux_2: Read complete after 1s [id=ami-0cabc39acf991f4f1]
module.us-east-1.module.platform.data.aws_route53_zone.ktech_public: Read complete after 1s [id=Z05014963P29XRPD1Q5CR]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.us-east-1.data.aws_route53_zone.private_zone will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_route53_zone" "private_zone" {
      + arn                        = (known after apply)
      + caller_reference           = (known after apply)
      + comment                    = (known after apply)
      + id                         = (known after apply)
      + linked_service_description = (known after apply)
      + linked_service_principal   = (known after apply)
      + name                       = "dev.private.ktech-br.com"
      + name_servers               = (known after apply)
      + private_zone               = true
      + resource_record_set_count  = (known after apply)
      + tags                       = (known after apply)
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)
    }

  # module.us-east-1.aws_key_pair.terraform-aws will be created
  + resource "aws_key_pair" "terraform-aws" {
      + arn             = (known after apply)
      + fingerprint     = (known after apply)
      + id              = (known after apply)
      + key_name        = "terraform-aws-dev"
      + key_name_prefix = (known after apply)
      + key_pair_id     = (known after apply)
      + key_type        = (known after apply)
      + public_key      = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDDoBTWwmaTCU/mB3zab7752eljzlfAJsKJ3GwAgyZo+fOTcAy0E/QL14S9zoAyNMaZNCSMeNdvhvf4pE8S43GXbqnikAboDWN6X6ZoWdLu6OEQzTgNK1dfz8pk5/R9xMSCqpBwJoR7a5Xv+nOT6BBBusC5KDV9W7VletszKeTmtWOdrbE6AiiW8qJpwtR1uNXfNdHKyY8YiuFMvx6A+5k2mNIhqe2ejG3x4UBKwS1VYJRj1bxx0fedEqGblnAlLzFIzcdMYAKBCeJACfe8moRXZRm5gMaD4nWygvJznnckKC5UyfpPQh3BacRrz4KXgoHY/ChP4wyDb6NsusjL2L63vv/nukbvUyU+YKBpNwqetMi8Ez2PPl97oBCu79cf9NhLXkDtU4YdCsE7YVzf8cIpEph92tvAlyG7S5jYpJsvg+vmckeSfg8w/IHqXic2XB24qyTBQ2iVojOwBN140PbVAuekJUtWAQ7ABdZWfY20P0hzSXfdN631IV8wftqJp2M= kaio.fellipe@200012-sp-nb"
      + tags_all        = {
          + "Env"       = "dev"
          + "ManagedBy" = "Terraform"
        }
    }

  # module.us-east-1.module.platform.aws_security_group.allow_ansible_admin_subnet_ssh will be created
  + resource "aws_security_group" "allow_ansible_admin_subnet_ssh" {
      + arn                    = (known after apply)
      + description            = "allow_ansible_admin_subnet_ssh-dev"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.1.1.0/24",
                ]
              + description      = ""
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = "allow_ansible_admin_subnet_ssh-dev"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "ssh"
        }
      + tags_all               = {
          + "Env"       = "dev"
          + "ManagedBy" = "Terraform"
          + "Name"      = "ssh"
        }
      + vpc_id                 = (known after apply)
    }

  # module.us-east-1.module.platform.aws_security_group.allow_bastion_ssh will be created
  + resource "aws_security_group" "allow_bastion_ssh" {
      + arn                    = (known after apply)
      + description            = "allow_bastion_ssh-dev"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = (known after apply)
              + description      = ""
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = "allow_bastion_ssh-dev"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "ssh"
        }
      + tags_all               = {
          + "Env"       = "dev"
          + "ManagedBy" = "Terraform"
          + "Name"      = "ssh"
        }
      + vpc_id                 = (known after apply)
    }

  # module.us-east-1.module.platform.aws_security_group.allow_outbound will be created
  + resource "aws_security_group" "allow_outbound" {
      + arn                    = (known after apply)
      + description            = "allow_outbound-dev"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "allow_outbound-dev"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "outbound"
        }
      + tags_all               = {
          + "Env"       = "dev"
          + "ManagedBy" = "Terraform"
          + "Name"      = "outbound"
        }
      + vpc_id                 = (known after apply)
    }

  # module.us-east-1.module.platform.aws_security_group.allow_ping will be created
  + resource "aws_security_group" "allow_ping" {
      + arn                    = (known after apply)
      + description            = "allow_ping-dev"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.1.0.0/16",
                ]
              + description      = ""
              + from_port        = -1
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "icmp"
              + security_groups  = []
              + self             = false
              + to_port          = -1
            },
        ]
      + name                   = "allow_ping-dev"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "ping"
        }
      + tags_all               = {
          + "Env"       = "dev"
          + "ManagedBy" = "Terraform"
          + "Name"      = "ping"
        }
      + vpc_id                 = (known after apply)
    }

  # module.us-east-1.module.vpc.aws_db_subnet_group.database[0] will be created
  + resource "aws_db_subnet_group" "database" {
      + arn         = (known after apply)
      + description = "Database subnet group for vpc-us-east-1-dev"
      + id          = (known after apply)
      + name        = "vpc-us-east-1-dev"
      + name_prefix = (known after apply)
      + subnet_ids  = (known after apply)
      + tags        = {
          + "Name" = "vpc-us-east-1-dev"
        }
      + tags_all    = {
          + "Env"       = "dev"
          + "ManagedBy" = "Terraform"
          + "Name"      = "vpc-us-east-1-dev"
        }
    }

  # module.us-east-1.module.vpc.aws_eip.nat[0] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "vpc-us-east-1-dev-us-east-1a"
        }
      + tags_all             = {
          + "Env"       = "dev"
          + "ManagedBy" = "Terraform"
          + "Name"      = "vpc-us-east-1-dev-us-east-1a"
        }
      + vpc                  = true
    }

  # module.us-east-1.module.vpc.aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "vpc-us-east-1-dev"
        }
      + tags_all = {
          + "Env"       = "dev"
          + "ManagedBy" = "Terraform"
          + "Name"      = "vpc-us-east-1-dev"
        }
      + vpc_id   = (known after apply)
    }

  # module.us-east-1.module.vpc.aws_nat_gateway.this[0] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id        = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Name" = "vpc-us-east-1-dev-us-east-1a"
        }
      + tags_all             = {
          + "Env"       = "dev"
          + "ManagedBy" = "Terraform"
          + "Name"      = "vpc-us-east-1-dev-us-east-1a"
        }
    }

  # module.us-east-1.module.vpc.aws_route.private_nat_gateway[0] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.us-east-1.module.vpc.aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.us-east-1.module.vpc.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "vpc-us-east-1-dev-private"
        }
      + tags_all         = {
          + "Env"       = "dev"
          + "ManagedBy" = "Terraform"
          + "Name"      = "vpc-us-east-1-dev-private"
        }
      + vpc_id           = (known after apply)
    }

  # module.us-east-1.module.vpc.aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "vpc-us-east-1-dev-public"
        }
      + tags_all         = {
          + "Env"       = "dev"
          + "ManagedBy" = "Terraform"
          + "Name"      = "vpc-us-east-1-dev-public"
        }
      + vpc_id           = (known after apply)
    }

  # module.us-east-1.module.vpc.aws_route_table_association.database[0] will be created
  + resource "aws_route_table_association" "database" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.us-east-1.module.vpc.aws_route_table_association.database[1] will be created
  + resource "aws_route_table_association" "database" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.us-east-1.module.vpc.aws_route_table_association.database[2] will be created
  + resource "aws_route_table_association" "database" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.us-east-1.module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.us-east-1.module.vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.us-east-1.module.vpc.aws_route_table_association.private[2] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.us-east-1.module.vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.us-east-1.module.vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.us-east-1.module.vpc.aws_route_table_association.public[2] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.us-east-1.module.vpc.aws_subnet.database[0] will be created
  + resource "aws_subnet" "database" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.1.201.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "vpc-us-east-1-dev-db-us-east-1a"
        }
      + tags_all                                       = {
          + "Env"       = "dev"
          + "ManagedBy" = "Terraform"
          + "Name"      = "vpc-us-east-1-dev-db-us-east-1a"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.us-east-1.module.vpc.aws_subnet.database[1] will be created
  + resource "aws_subnet" "database" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.1.202.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "vpc-us-east-1-dev-db-us-east-1b"
        }
      + tags_all                                       = {
          + "Env"       = "dev"
          + "ManagedBy" = "Terraform"
          + "Name"      = "vpc-us-east-1-dev-db-us-east-1b"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.us-east-1.module.vpc.aws_subnet.database[2] will be created
  + resource "aws_subnet" "database" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.1.203.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "vpc-us-east-1-dev-db-us-east-1c"
        }
      + tags_all                                       = {
          + "Env"       = "dev"
          + "ManagedBy" = "Terraform"
          + "Name"      = "vpc-us-east-1-dev-db-us-east-1c"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.us-east-1.module.vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.1.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "vpc-us-east-1-dev-private-us-east-1a"
        }
      + tags_all                                       = {
          + "Env"       = "dev"
          + "ManagedBy" = "Terraform"
          + "Name"      = "vpc-us-east-1-dev-private-us-east-1a"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.us-east-1.module.vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.1.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "vpc-us-east-1-dev-private-us-east-1b"
        }
      + tags_all                                       = {
          + "Env"       = "dev"
          + "ManagedBy" = "Terraform"
          + "Name"      = "vpc-us-east-1-dev-private-us-east-1b"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.us-east-1.module.vpc.aws_subnet.private[2] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.1.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "vpc-us-east-1-dev-private-us-east-1c"
        }
      + tags_all                                       = {
          + "Env"       = "dev"
          + "ManagedBy" = "Terraform"
          + "Name"      = "vpc-us-east-1-dev-private-us-east-1c"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.us-east-1.module.vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.1.101.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "vpc-us-east-1-dev-public-us-east-1a"
        }
      + tags_all                                       = {
          + "Env"       = "dev"
          + "ManagedBy" = "Terraform"
          + "Name"      = "vpc-us-east-1-dev-public-us-east-1a"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.us-east-1.module.vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.1.102.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "vpc-us-east-1-dev-public-us-east-1b"
        }
      + tags_all                                       = {
          + "Env"       = "dev"
          + "ManagedBy" = "Terraform"
          + "Name"      = "vpc-us-east-1-dev-public-us-east-1b"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.us-east-1.module.vpc.aws_subnet.public[2] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.1.103.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "vpc-us-east-1-dev-public-us-east-1c"
        }
      + tags_all                                       = {
          + "Env"       = "dev"
          + "ManagedBy" = "Terraform"
          + "Name"      = "vpc-us-east-1-dev-public-us-east-1c"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.us-east-1.module.vpc.aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + assign_generated_ipv6_cidr_block     = false
      + cidr_block                           = "10.1.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "vpc-us-east-1-dev"
        }
      + tags_all                             = {
          + "Env"       = "dev"
          + "ManagedBy" = "Terraform"
          + "Name"      = "vpc-us-east-1-dev"
        }
    }

  # module.us-east-1.module.zones.aws_route53_zone.this["dev.private.ktech-br.com"] will be created
  + resource "aws_route53_zone" "this" {
      + arn           = (known after apply)
      + comment       = "dev.private.ktech-br.com (Private zone for env: dev)"
      + force_destroy = false
      + id            = (known after apply)
      + name          = "dev.private.ktech-br.com"
      + name_servers  = (known after apply)
      + tags          = {
          + "Name" = "dev.private.ktech-br.com"
        }
      + tags_all      = {
          + "Env"       = "dev"
          + "ManagedBy" = "Terraform"
          + "Name"      = "dev.private.ktech-br.com"
        }
      + zone_id       = (known after apply)

      + vpc {
          + vpc_id     = (known after apply)
          + vpc_region = (known after apply)
        }
    }

  # module.us-east-1.module.platform.module.ansible_server.aws_codedeploy_app.ansible will be created
  + resource "aws_codedeploy_app" "ansible" {
      + application_id      = (known after apply)
      + arn                 = (known after apply)
      + compute_platform    = "Server"
      + github_account_name = (known after apply)
      + id                  = (known after apply)
      + linked_to_github    = (known after apply)
      + name                = "ansible-app-dev"
      + tags_all            = {
          + "Env"       = "dev"
          + "ManagedBy" = "Terraform"
        }
    }

  # module.us-east-1.module.platform.module.ansible_server.aws_codedeploy_deployment_config.ansible will be created
  + resource "aws_codedeploy_deployment_config" "ansible" {
      + compute_platform       = "Server"
      + deployment_config_id   = (known after apply)
      + deployment_config_name = "ansible-deployment-config-dev"
      + id                     = (known after apply)

      + minimum_healthy_hosts {
          + type  = "HOST_COUNT"
          + value = 0
        }
    }

  # module.us-east-1.module.platform.module.ansible_server.aws_codedeploy_deployment_group.ansible will be created
  + resource "aws_codedeploy_deployment_group" "ansible" {
      + app_name               = "ansible-app-dev"
      + arn                    = (known after apply)
      + compute_platform       = (known after apply)
      + deployment_config_name = (known after apply)
      + deployment_group_id    = (known after apply)
      + deployment_group_name  = "ansible-group-dev"
      + id                     = (known after apply)
      + service_role_arn       = (known after apply)
      + tags_all               = {
          + "Env"       = "dev"
          + "ManagedBy" = "Terraform"
        }

      + blue_green_deployment_config {
          + deployment_ready_option {
              + action_on_timeout    = (known after apply)
              + wait_time_in_minutes = (known after apply)
            }

          + green_fleet_provisioning_option {
              + action = (known after apply)
            }

          + terminate_blue_instances_on_deployment_success {
              + action                           = (known after apply)
              + termination_wait_time_in_minutes = (known after apply)
            }
        }

      + ec2_tag_set {
          + ec2_tag_filter {
              + key   = "App"
              + type  = "KEY_AND_VALUE"
              + value = "ansible-dev"
            }
        }
    }

  # module.us-east-1.module.platform.module.ansible_server.aws_codepipeline.codepipeline will be created
  + resource "aws_codepipeline" "codepipeline" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "ansible-deploy-pipeline-dev"
      + role_arn = (known after apply)
      + tags_all = {
          + "Env"       = "dev"
          + "ManagedBy" = "Terraform"
        }

      + artifact_store {
          + location = "codepipeline-ansible-ktech-br-dev"
          + region   = (known after apply)
          + type     = "S3"

          + encryption_key {
              + id   = (known after apply)
              + type = "KMS"
            }
        }

      + stage {
          + name = "Source"

          + action {
              + category         = "Source"
              + configuration    = {
                  + "PollForSourceChanges" = "true"
                  + "S3Bucket"             = "codepipeline-ansible-ktech-br-dev"
                  + "S3ObjectKey"          = "deploy/ansible.zip"
                }
              + name             = "S3_Source"
              + output_artifacts = [
                  + "source_output",
                ]
              + owner            = "AWS"
              + provider         = "S3"
              + region           = (known after apply)
              + run_order        = (known after apply)
              + version          = "1"
            }
        }
      + stage {
          + name = "Deploy"

          + action {
              + category        = "Deploy"
              + configuration   = {
                  + "ApplicationName"     = "ansible-app-dev"
                  + "DeploymentGroupName" = "ansible-group-dev"
                }
              + input_artifacts = [
                  + "source_output",
                ]
              + name            = "Deploy"
              + owner           = "AWS"
              + provider        = "CodeDeploy"
              + region          = (known after apply)
              + run_order       = (known after apply)
              + version         = "1"
            }
        }
    }

  # module.us-east-1.module.platform.module.ansible_server.aws_iam_instance_profile.ansible_ec2_profile will be created
  + resource "aws_iam_instance_profile" "ansible_ec2_profile" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "ec2_ansible_profile-dev"
      + path        = "/"
      + role        = "ec2_ansible_role-dev"
      + tags_all    = {
          + "Env"       = "dev"
          + "ManagedBy" = "Terraform"
        }
      + unique_id   = (known after apply)
    }

  # module.us-east-1.module.platform.module.ansible_server.aws_iam_openid_connect_provider.github_actions will be created
  + resource "aws_iam_openid_connect_provider" "github_actions" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags_all        = {
          + "Env"       = "dev"
          + "ManagedBy" = "Terraform"
        }
      + thumbprint_list = [
          + "6938fd4d98bab03faadb97b34396831e3780aea1",
        ]
      + url             = "https://token.actions.githubusercontent.com"
    }

  # module.us-east-1.module.platform.module.ansible_server.aws_iam_role.ansible_ec2_role will be created
  + resource "aws_iam_role" "ansible_ec2_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ec2_ansible_role-dev"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Env"       = "dev"
          + "ManagedBy" = "Terraform"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.us-east-1.module.platform.module.ansible_server.aws_iam_role.codedeploy_role will be created
  + resource "aws_iam_role" "codedeploy_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "codedeploy.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ansible_codedeploy_role-dev"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Env"       = "dev"
          + "ManagedBy" = "Terraform"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.us-east-1.module.platform.module.ansible_server.aws_iam_role.codepipeline_role will be created
  + resource "aws_iam_role" "codepipeline_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "codepipeline.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "codepipeline_ansible_role-dev"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Env"       = "dev"
          + "ManagedBy" = "Terraform"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.us-east-1.module.platform.module.ansible_server.aws_iam_role.github_role will be created
  + resource "aws_iam_role" "github_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "github_ansible_role-dev"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Env"       = "dev"
          + "ManagedBy" = "Terraform"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.us-east-1.module.platform.module.ansible_server.aws_iam_role_policy.ansible_ec2_policy will be created
  + resource "aws_iam_role_policy" "ansible_ec2_policy" {
      + id     = (known after apply)
      + name   = "ec2_ansible_policy-dev"
      + policy = (known after apply)
      + role   = (known after apply)
    }

  # module.us-east-1.module.platform.module.ansible_server.aws_iam_role_policy.ansible_ec2_policy_inventory will be created
  + resource "aws_iam_role_policy" "ansible_ec2_policy_inventory" {
      + id     = (known after apply)
      + name   = "ec2_ansible_policy_inventory-dev"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ec2:DescribeInstances",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # module.us-east-1.module.platform.module.ansible_server.aws_iam_role_policy.codepipeline_policy will be created
  + resource "aws_iam_role_policy" "codepipeline_policy" {
      + id     = (known after apply)
      + name   = "codepipeline_policy-dev"
      + policy = (known after apply)
      + role   = (known after apply)
    }

  # module.us-east-1.module.platform.module.ansible_server.aws_iam_role_policy.github_policy will be created
  + resource "aws_iam_role_policy" "github_policy" {
      + id     = (known after apply)
      + name   = "github_ansible_policy-dev"
      + policy = (known after apply)
      + role   = (known after apply)
    }

  # module.us-east-1.module.platform.module.ansible_server.aws_iam_role_policy_attachment.AWSCodeDeployRole will be created
  + resource "aws_iam_role_policy_attachment" "AWSCodeDeployRole" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSCodeDeployRole"
      + role       = "ansible_codedeploy_role-dev"
    }

  # module.us-east-1.module.platform.module.ansible_server.aws_kms_alias.key_alias will be created
  + resource "aws_kms_alias" "key_alias" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/ansible-bucket-key"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # module.us-east-1.module.platform.module.ansible_server.aws_kms_key.ansible_bucket_key will be created
  + resource "aws_kms_key" "ansible_bucket_key" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 10
      + description                        = "This key is used to encrypt bucket objects"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + tags_all                           = {
          + "Env"       = "dev"
          + "ManagedBy" = "Terraform"
        }
    }

  # module.us-east-1.module.platform.module.ansible_server.aws_route53_record.grafana_private will be created
  + resource "aws_route53_record" "grafana_private" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "ansible.dev.private.ktech-br.com"
      + records         = (known after apply)
      + ttl             = 300
      + type            = "A"
      + zone_id         = (known after apply)
    }

  # module.us-east-1.module.platform.module.ansible_server.aws_s3_bucket.codepipeline_bucket will be created
  + resource "aws_s3_bucket" "codepipeline_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "codepipeline-ansible-ktech-br-dev"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = {
          + "Env"       = "dev"
          + "ManagedBy" = "Terraform"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule {
          + allowed_headers = (known after apply)
          + allowed_methods = (known after apply)
          + allowed_origins = (known after apply)
          + expose_headers  = (known after apply)
          + max_age_seconds = (known after apply)
        }

      + grant {
          + id          = (known after apply)
          + permissions = (known after apply)
          + type        = (known after apply)
          + uri         = (known after apply)
        }

      + lifecycle_rule {
          + abort_incomplete_multipart_upload_days = (known after apply)
          + enabled                                = (known after apply)
          + id                                     = (known after apply)
          + prefix                                 = (known after apply)
          + tags                                   = (known after apply)

          + expiration {
              + date                         = (known after apply)
              + days                         = (known after apply)
              + expired_object_delete_marker = (known after apply)
            }

          + noncurrent_version_expiration {
              + days = (known after apply)
            }

          + noncurrent_version_transition {
              + days          = (known after apply)
              + storage_class = (known after apply)
            }

          + transition {
              + date          = (known after apply)
              + days          = (known after apply)
              + storage_class = (known after apply)
            }
        }

      + logging {
          + target_bucket = (known after apply)
          + target_prefix = (known after apply)
        }

      + object_lock_configuration {
          + object_lock_enabled = (known after apply)

          + rule {
              + default_retention {
                  + days  = (known after apply)
                  + mode  = (known after apply)
                  + years = (known after apply)
                }
            }
        }

      + replication_configuration {
          + role = (known after apply)

          + rules {
              + delete_marker_replication_status = (known after apply)
              + id                               = (known after apply)
              + prefix                           = (known after apply)
              + priority                         = (known after apply)
              + status                           = (known after apply)

              + destination {
                  + account_id         = (known after apply)
                  + bucket             = (known after apply)
                  + replica_kms_key_id = (known after apply)
                  + storage_class      = (known after apply)

                  + access_control_translation {
                      + owner = (known after apply)
                    }

                  + metrics {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }

                  + replication_time {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }
                }

              + filter {
                  + prefix = (known after apply)
                  + tags   = (known after apply)
                }

              + source_selection_criteria {
                  + sse_kms_encrypted_objects {
                      + enabled = (known after apply)
                    }
                }
            }
        }

      + server_side_encryption_configuration {
          + rule {
              + bucket_key_enabled = (known after apply)

              + apply_server_side_encryption_by_default {
                  + kms_master_key_id = (known after apply)
                  + sse_algorithm     = (known after apply)
                }
            }
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }

      + website {
          + error_document           = (known after apply)
          + index_document           = (known after apply)
          + redirect_all_requests_to = (known after apply)
          + routing_rules            = (known after apply)
        }
    }

  # module.us-east-1.module.platform.module.ansible_server.aws_s3_bucket_acl.codepipeline_bucket will be created
  + resource "aws_s3_bucket_acl" "codepipeline_bucket" {
      + acl    = "private"
      + bucket = (known after apply)
      + id     = (known after apply)

      + access_control_policy {
          + grant {
              + permission = (known after apply)

              + grantee {
                  + display_name  = (known after apply)
                  + email_address = (known after apply)
                  + id            = (known after apply)
                  + type          = (known after apply)
                  + uri           = (known after apply)
                }
            }

          + owner {
              + display_name = (known after apply)
              + id           = (known after apply)
            }
        }
    }

  # module.us-east-1.module.platform.module.ansible_server.aws_s3_bucket_versioning.codepipeline_bucket will be created
  + resource "aws_s3_bucket_versioning" "codepipeline_bucket" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # module.us-east-1.module.platform.module.bastion.aws_route53_record.bastion_public will be created
  + resource "aws_route53_record" "bastion_public" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "bastion.dev.ktech-devops.com.br"
      + records         = (known after apply)
      + ttl             = 300
      + type            = "A"
      + zone_id         = "Z05014963P29XRPD1Q5CR"
    }

  # module.us-east-1.module.platform.module.bastion.aws_route53_record.grafana_private will be created
  + resource "aws_route53_record" "grafana_private" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "bastion.dev.private.ktech-br.com"
      + records         = (known after apply)
      + ttl             = 300
      + type            = "A"
      + zone_id         = (known after apply)
    }

  # module.us-east-1.module.platform.module.bastion.aws_security_group.bastion_public_ssh will be created
  + resource "aws_security_group" "bastion_public_ssh" {
      + arn                    = (known after apply)
      + description            = "bastion_public_ssh-dev"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "201.33.192.0/20",
                  + "200.186.50.162/32",
                  + "45.239.100.0/22",
                ]
              + description      = ""
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = "bastion_public_ssh-dev"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "ssh"
        }
      + tags_all               = {
          + "Env"       = "dev"
          + "ManagedBy" = "Terraform"
          + "Name"      = "ssh"
        }
      + vpc_id                 = (known after apply)
    }

  # module.us-east-1.module.platform.module.grafana_dashboards.aws_route53_record.grafana_private will be created
  + resource "aws_route53_record" "grafana_private" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "grafana.dev.private.ktech-br.com"
      + records         = (known after apply)
      + ttl             = 300
      + type            = "A"
      + zone_id         = (known after apply)
    }

  # module.us-east-1.module.platform.module.grafana_dashboards.aws_route53_record.grafana_public will be created
  + resource "aws_route53_record" "grafana_public" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "grafana.dev.ktech-devops.com.br"
      + records         = (known after apply)
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = "Z05014963P29XRPD1Q5CR"
    }

  # module.us-east-1.module.platform.module.grafana_dashboards.aws_route53_record.rds_private will be created
  + resource "aws_route53_record" "rds_private" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "grafana-rds.dev.private.ktech-br.com"
      + records         = (known after apply)
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = (known after apply)
    }

  # module.us-east-1.module.platform.module.grafana_dashboards.aws_security_group.grafana_http_instance will be created
  + resource "aws_security_group" "grafana_http_instance" {
      + arn                    = (known after apply)
      + description            = "grafana_http_instance-dev"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 3000
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 3000
            },
        ]
      + name                   = "grafana_http_instance-dev"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "grafana-dashboards"
        }
      + tags_all               = {
          + "Env"       = "dev"
          + "ManagedBy" = "Terraform"
          + "Name"      = "grafana-dashboards"
        }
      + vpc_id                 = (known after apply)
    }

  # module.us-east-1.module.platform.module.grafana_dashboards.aws_security_group.sg_grafana_http will be created
  + resource "aws_security_group" "sg_grafana_http" {
      + arn                    = (known after apply)
      + description            = "alb_grafana_http-dev"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "201.33.192.0/20",
                  + "200.186.50.162/32",
                  + "45.239.100.0/22",
                ]
              + description      = ""
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "alb_grafana_http-dev"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "grafana-dashboards"
        }
      + tags_all               = {
          + "Env"       = "dev"
          + "ManagedBy" = "Terraform"
          + "Name"      = "grafana-dashboards"
        }
      + vpc_id                 = (known after apply)
    }

  # module.us-east-1.module.platform.module.grafana_dashboards.aws_security_group.sg_grafana_https will be created
  + resource "aws_security_group" "sg_grafana_https" {
      + arn                    = (known after apply)
      + description            = "alb_grafana_https-dev"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "201.33.192.0/20",
                  + "200.186.50.162/32",
                  + "45.239.100.0/22",
                ]
              + description      = ""
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
      + name                   = "alb_grafana_https-dev"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "grafana-dashboards"
        }
      + tags_all               = {
          + "Env"       = "dev"
          + "ManagedBy" = "Terraform"
          + "Name"      = "grafana-dashboards"
        }
      + vpc_id                 = (known after apply)
    }

  # module.us-east-1.module.platform.module.grafana_loki.aws_iam_instance_profile.loki_ec2_profile will be created
  + resource "aws_iam_instance_profile" "loki_ec2_profile" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "ec2_loki_profile-dev"
      + path        = "/"
      + role        = "ec2_loki_role-dev"
      + tags_all    = {
          + "Env"       = "dev"
          + "ManagedBy" = "Terraform"
        }
      + unique_id   = (known after apply)
    }

  # module.us-east-1.module.platform.module.grafana_loki.aws_iam_role.loki_ec2_role will be created
  + resource "aws_iam_role" "loki_ec2_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ec2_loki_role-dev"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Env"       = "dev"
          + "ManagedBy" = "Terraform"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.us-east-1.module.platform.module.grafana_loki.aws_iam_role_policy.loki_ec2_policy will be created
  + resource "aws_iam_role_policy" "loki_ec2_policy" {
      + id     = (known after apply)
      + name   = "ec2_loki_policy-dev"
      + policy = (known after apply)
      + role   = (known after apply)
    }

  # module.us-east-1.module.platform.module.grafana_loki.aws_kms_alias.key_alias will be created
  + resource "aws_kms_alias" "key_alias" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/loki-bucket-key"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # module.us-east-1.module.platform.module.grafana_loki.aws_kms_key.loki_bucket_key will be created
  + resource "aws_kms_key" "loki_bucket_key" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 10
      + description                        = "This key is used to encrypt bucket objects"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + tags_all                           = {
          + "Env"       = "dev"
          + "ManagedBy" = "Terraform"
        }
    }

  # module.us-east-1.module.platform.module.grafana_loki.aws_route53_record.loki01_private will be created
  + resource "aws_route53_record" "loki01_private" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "loki01.dev.private.ktech-br.com"
      + records         = (known after apply)
      + ttl             = 300
      + type            = "A"
      + zone_id         = (known after apply)
    }

  # module.us-east-1.module.platform.module.grafana_loki.aws_route53_record.loki02_private will be created
  + resource "aws_route53_record" "loki02_private" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "loki02.dev.private.ktech-br.com"
      + records         = (known after apply)
      + ttl             = 300
      + type            = "A"
      + zone_id         = (known after apply)
    }

  # module.us-east-1.module.platform.module.grafana_loki.aws_route53_record.loki_alb will be created
  + resource "aws_route53_record" "loki_alb" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "loki-alb.dev.private.ktech-br.com"
      + records         = (known after apply)
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = (known after apply)
    }

  # module.us-east-1.module.platform.module.grafana_loki.aws_s3_bucket.loki_bucket will be created
  + resource "aws_s3_bucket" "loki_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "loki-bucket-ktech-br-dev"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = {
          + "Env"       = "dev"
          + "ManagedBy" = "Terraform"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule {
          + allowed_headers = (known after apply)
          + allowed_methods = (known after apply)
          + allowed_origins = (known after apply)
          + expose_headers  = (known after apply)
          + max_age_seconds = (known after apply)
        }

      + grant {
          + id          = (known after apply)
          + permissions = (known after apply)
          + type        = (known after apply)
          + uri         = (known after apply)
        }

      + lifecycle_rule {
          + abort_incomplete_multipart_upload_days = (known after apply)
          + enabled                                = (known after apply)
          + id                                     = (known after apply)
          + prefix                                 = (known after apply)
          + tags                                   = (known after apply)

          + expiration {
              + date                         = (known after apply)
              + days                         = (known after apply)
              + expired_object_delete_marker = (known after apply)
            }

          + noncurrent_version_expiration {
              + days = (known after apply)
            }

          + noncurrent_version_transition {
              + days          = (known after apply)
              + storage_class = (known after apply)
            }

          + transition {
              + date          = (known after apply)
              + days          = (known after apply)
              + storage_class = (known after apply)
            }
        }

      + logging {
          + target_bucket = (known after apply)
          + target_prefix = (known after apply)
        }

      + object_lock_configuration {
          + object_lock_enabled = (known after apply)

          + rule {
              + default_retention {
                  + days  = (known after apply)
                  + mode  = (known after apply)
                  + years = (known after apply)
                }
            }
        }

      + replication_configuration {
          + role = (known after apply)

          + rules {
              + delete_marker_replication_status = (known after apply)
              + id                               = (known after apply)
              + prefix                           = (known after apply)
              + priority                         = (known after apply)
              + status                           = (known after apply)

              + destination {
                  + account_id         = (known after apply)
                  + bucket             = (known after apply)
                  + replica_kms_key_id = (known after apply)
                  + storage_class      = (known after apply)

                  + access_control_translation {
                      + owner = (known after apply)
                    }

                  + metrics {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }

                  + replication_time {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }
                }

              + filter {
                  + prefix = (known after apply)
                  + tags   = (known after apply)
                }

              + source_selection_criteria {
                  + sse_kms_encrypted_objects {
                      + enabled = (known after apply)
                    }
                }
            }
        }

      + server_side_encryption_configuration {
          + rule {
              + bucket_key_enabled = (known after apply)

              + apply_server_side_encryption_by_default {
                  + kms_master_key_id = (known after apply)
                  + sse_algorithm     = (known after apply)
                }
            }
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }

      + website {
          + error_document           = (known after apply)
          + index_document           = (known after apply)
          + redirect_all_requests_to = (known after apply)
          + routing_rules            = (known after apply)
        }
    }

  # module.us-east-1.module.platform.module.grafana_loki.aws_s3_bucket_acl.loki_bucket will be created
  + resource "aws_s3_bucket_acl" "loki_bucket" {
      + acl    = "private"
      + bucket = (known after apply)
      + id     = (known after apply)

      + access_control_policy {
          + grant {
              + permission = (known after apply)

              + grantee {
                  + display_name  = (known after apply)
                  + email_address = (known after apply)
                  + id            = (known after apply)
                  + type          = (known after apply)
                  + uri           = (known after apply)
                }
            }

          + owner {
              + display_name = (known after apply)
              + id           = (known after apply)
            }
        }
    }

  # module.us-east-1.module.platform.module.grafana_loki.aws_s3_bucket_public_access_block.block will be created
  + resource "aws_s3_bucket_public_access_block" "block" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.us-east-1.module.platform.module.grafana_loki.aws_s3_bucket_versioning.loki_bucket will be created
  + resource "aws_s3_bucket_versioning" "loki_bucket" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Disabled"
        }
    }

  # module.us-east-1.module.platform.module.grafana_loki.aws_security_group.loki_http_instance will be created
  + resource "aws_security_group" "loki_http_instance" {
      + arn                    = (known after apply)
      + description            = "loki_http_instance-dev"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 3100
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 3100
            },
        ]
      + name                   = "loki_http_instance-dev"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "loki-dashboards"
        }
      + tags_all               = {
          + "Env"       = "dev"
          + "ManagedBy" = "Terraform"
          + "Name"      = "loki-dashboards"
        }
      + vpc_id                 = (known after apply)
    }

  # module.us-east-1.module.platform.module.grafana_loki.aws_security_group.sg_loki_http will be created
  + resource "aws_security_group" "sg_loki_http" {
      + arn                    = (known after apply)
      + description            = "alb_loki_http-dev"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.1.0.0/16",
                ]
              + description      = ""
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "alb_loki_http-dev"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "loki-dashboards"
        }
      + tags_all               = {
          + "Env"       = "dev"
          + "ManagedBy" = "Terraform"
          + "Name"      = "loki-dashboards"
        }
      + vpc_id                 = (known after apply)
    }

  # module.us-east-1.module.platform.module.grafana_loki.aws_security_group.sg_loki_https will be created
  + resource "aws_security_group" "sg_loki_https" {
      + arn                    = (known after apply)
      + description            = "alb_loki_https-dev"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.1.0.0/16",
                ]
              + description      = ""
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
      + name                   = "alb_loki_https-dev"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "loki-dashboards"
        }
      + tags_all               = {
          + "Env"       = "dev"
          + "ManagedBy" = "Terraform"
          + "Name"      = "loki-dashboards"
        }
      + vpc_id                 = (known after apply)
    }

  # module.us-east-1.module.platform.module.ansible_server.module.ec2-instance.aws_instance.this[0] will be created
  + resource "aws_instance" "this" {
      + ami                                  = "ami-0cabc39acf991f4f1"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = "us-east-1a"
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "terraform-aws-dev"
      + monitoring                           = false
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "App"  = "ansible-dev"
          + "Name" = "ansible-server01-dev"
          + "Type" = "t2.micro"
        }
      + tags_all                             = {
          + "App"       = "ansible-dev"
          + "Env"       = "dev"
          + "ManagedBy" = "Terraform"
          + "Name"      = "ansible-server01-dev"
          + "Type"      = "t2.micro"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (sensitive)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + volume_tags                          = {
          + "Name" = "ansible-server01-dev"
        }
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      + credit_specification {}

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + maintenance_options {
          + auto_recovery = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_put_response_hop_limit = 1
          + http_tokens                 = "optional"
          + instance_metadata_tags      = "disabled"
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + private_dns_name_options {
          + enable_resource_name_dns_a_record    = (known after apply)
          + enable_resource_name_dns_aaaa_record = (known after apply)
          + hostname_type                        = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + timeouts {}
    }

  # module.us-east-1.module.platform.module.bastion.module.ec2-instance.aws_instance.this[0] will be created
  + resource "aws_instance" "this" {
      + ami                                  = "ami-0cabc39acf991f4f1"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = "us-east-1a"
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "terraform-aws-dev"
      + monitoring                           = false
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "App"  = "bastion"
          + "Name" = "bastion01-dev"
          + "Type" = "t2.micro"
        }
      + tags_all                             = {
          + "App"       = "bastion"
          + "Env"       = "dev"
          + "ManagedBy" = "Terraform"
          + "Name"      = "bastion01-dev"
          + "Type"      = "t2.micro"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (sensitive)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + volume_tags                          = {
          + "Name" = "bastion01-dev"
        }
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      + credit_specification {}

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + maintenance_options {
          + auto_recovery = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_put_response_hop_limit = 1
          + http_tokens                 = "optional"
          + instance_metadata_tags      = "disabled"
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + private_dns_name_options {
          + enable_resource_name_dns_a_record    = (known after apply)
          + enable_resource_name_dns_aaaa_record = (known after apply)
          + hostname_type                        = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + timeouts {}
    }

  # module.us-east-1.module.platform.module.grafana_dashboards.module.alb.aws_lb.this[0] will be created
  + resource "aws_lb" "this" {
      + arn                        = (known after apply)
      + arn_suffix                 = (known after apply)
      + desync_mitigation_mode     = "defensive"
      + dns_name                   = (known after apply)
      + drop_invalid_header_fields = false
      + enable_deletion_protection = false
      + enable_http2               = true
      + enable_waf_fail_open       = false
      + id                         = (known after apply)
      + idle_timeout               = 60
      + internal                   = false
      + ip_address_type            = "ipv4"
      + load_balancer_type         = "application"
      + name                       = "alb-grafana-dashboards-dev"
      + security_groups            = (known after apply)
      + subnets                    = (known after apply)
      + tags                       = {
          + "App"  = "grafana-dashboards"
          + "Name" = "alb-grafana-dashboards-dev"
        }
      + tags_all                   = {
          + "App"       = "grafana-dashboards"
          + "Env"       = "dev"
          + "ManagedBy" = "Terraform"
          + "Name"      = "alb-grafana-dashboards-dev"
        }
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)

      + subnet_mapping {
          + allocation_id        = (known after apply)
          + ipv6_address         = (known after apply)
          + outpost_id           = (known after apply)
          + private_ipv4_address = (known after apply)
          + subnet_id            = (known after apply)
        }

      + timeouts {
          + create = "10m"
          + delete = "10m"
          + update = "10m"
        }
    }

  # module.us-east-1.module.platform.module.grafana_dashboards.module.alb.aws_lb_listener.frontend_http_tcp[0] will be created
  + resource "aws_lb_listener" "frontend_http_tcp" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = {
          + "Env"       = "dev"
          + "ManagedBy" = "Terraform"
        }

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # module.us-east-1.module.platform.module.grafana_dashboards.module.alb.aws_lb_target_group.main[0] will be created
  + resource "aws_lb_target_group" "main" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = (known after apply)
      + name_prefix                        = "graf-"
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "App"  = "grafana-dashboards"
          + "Name" = "graf-"
        }
      + tags_all                           = {
          + "App"       = "grafana-dashboards"
          + "Env"       = "dev"
          + "ManagedBy" = "Terraform"
          + "Name"      = "graf-"
        }
      + target_type                        = "instance"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 30
          + matcher             = "200"
          + path                = "/login"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 6
          + unhealthy_threshold = 3
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + cookie_name     = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }
    }

  # module.us-east-1.module.platform.module.grafana_dashboards.module.alb.aws_lb_target_group_attachment.this["0.target"] will be created
  + resource "aws_lb_target_group_attachment" "this" {
      + id               = (known after apply)
      + port             = 3000
      + target_group_arn = (known after apply)
      + target_id        = (known after apply)
    }

  # module.us-east-1.module.platform.module.grafana_dashboards.module.ec2-instance.aws_instance.this[0] will be created
  + resource "aws_instance" "this" {
      + ami                                  = "ami-0cabc39acf991f4f1"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = "us-east-1b"
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "terraform-aws-dev"
      + monitoring                           = false
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "App"  = "grafana-dashboards"
          + "Name" = "grafana-dashboards01-dev"
          + "Type" = "t2.micro"
        }
      + tags_all                             = {
          + "App"       = "grafana-dashboards"
          + "Env"       = "dev"
          + "ManagedBy" = "Terraform"
          + "Name"      = "grafana-dashboards01-dev"
          + "Type"      = "t2.micro"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "39048a59378f2ffa048a4d1d92c05521fefc2ee8"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + volume_tags                          = {
          + "Name" = "grafana-dashboards01-dev"
        }
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      + credit_specification {}

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + maintenance_options {
          + auto_recovery = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_put_response_hop_limit = 1
          + http_tokens                 = "optional"
          + instance_metadata_tags      = "disabled"
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + private_dns_name_options {
          + enable_resource_name_dns_a_record    = (known after apply)
          + enable_resource_name_dns_aaaa_record = (known after apply)
          + hostname_type                        = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + timeouts {}
    }

  # module.us-east-1.module.platform.module.grafana_dashboards.module.sg_grafana_db.aws_security_group.this_name_prefix[0] will be created
  + resource "aws_security_group" "this_name_prefix" {
      + arn                    = (known after apply)
      + description            = "grafana_db-dev"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "grafana_db-dev-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "grafana_db-dev"
        }
      + tags_all               = {
          + "Env"       = "dev"
          + "ManagedBy" = "Terraform"
          + "Name"      = "grafana_db-dev"
        }
      + vpc_id                 = (known after apply)
    }

  # module.us-east-1.module.platform.module.grafana_dashboards.module.sg_grafana_db.aws_security_group_rule.ingress_with_cidr_blocks[0] will be created
  + resource "aws_security_group_rule" "ingress_with_cidr_blocks" {
      + cidr_blocks              = (known after apply)
      + description              = "PostgreSQL access from within VPC"
      + from_port                = 5432
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 5432
      + type                     = "ingress"
    }

  # module.us-east-1.module.platform.module.grafana_loki.module.alb.aws_lb.this[0] will be created
  + resource "aws_lb" "this" {
      + arn                        = (known after apply)
      + arn_suffix                 = (known after apply)
      + desync_mitigation_mode     = "defensive"
      + dns_name                   = (known after apply)
      + drop_invalid_header_fields = false
      + enable_deletion_protection = false
      + enable_http2               = true
      + enable_waf_fail_open       = false
      + id                         = (known after apply)
      + idle_timeout               = 60
      + internal                   = true
      + ip_address_type            = "ipv4"
      + load_balancer_type         = "application"
      + name                       = "alb-grafana-loki-dev"
      + security_groups            = (known after apply)
      + subnets                    = (known after apply)
      + tags                       = {
          + "App"  = "grafana-loki"
          + "Name" = "alb-grafana-loki-dev"
        }
      + tags_all                   = {
          + "App"       = "grafana-loki"
          + "Env"       = "dev"
          + "ManagedBy" = "Terraform"
          + "Name"      = "alb-grafana-loki-dev"
        }
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)

      + subnet_mapping {
          + allocation_id        = (known after apply)
          + ipv6_address         = (known after apply)
          + outpost_id           = (known after apply)
          + private_ipv4_address = (known after apply)
          + subnet_id            = (known after apply)
        }

      + timeouts {
          + create = "10m"
          + delete = "10m"
          + update = "10m"
        }
    }

  # module.us-east-1.module.platform.module.grafana_loki.module.alb.aws_lb_listener.frontend_http_tcp[0] will be created
  + resource "aws_lb_listener" "frontend_http_tcp" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = {
          + "Env"       = "dev"
          + "ManagedBy" = "Terraform"
        }

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # module.us-east-1.module.platform.module.grafana_loki.module.alb.aws_lb_target_group.main[0] will be created
  + resource "aws_lb_target_group" "main" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = (known after apply)
      + name_prefix                        = "loki-"
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "App"  = "grafana-loki"
          + "Name" = "loki-"
        }
      + tags_all                           = {
          + "App"       = "grafana-loki"
          + "Env"       = "dev"
          + "ManagedBy" = "Terraform"
          + "Name"      = "loki-"
        }
      + target_type                        = "instance"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 30
          + matcher             = "200"
          + path                = "/metrics"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 6
          + unhealthy_threshold = 3
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + cookie_name     = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }
    }

  # module.us-east-1.module.platform.module.grafana_loki.module.alb.aws_lb_target_group_attachment.this["0.target01"] will be created
  + resource "aws_lb_target_group_attachment" "this" {
      + id               = (known after apply)
      + port             = 3100
      + target_group_arn = (known after apply)
      + target_id        = (known after apply)
    }

  # module.us-east-1.module.platform.module.grafana_loki.module.alb.aws_lb_target_group_attachment.this["0.target02"] will be created
  + resource "aws_lb_target_group_attachment" "this" {
      + id               = (known after apply)
      + port             = 3100
      + target_group_arn = (known after apply)
      + target_id        = (known after apply)
    }

  # module.us-east-1.module.platform.module.grafana_loki.module.ec2-instance01.aws_instance.this[0] will be created
  + resource "aws_instance" "this" {
      + ami                                  = "ami-0cabc39acf991f4f1"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = "us-east-1b"
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "terraform-aws-dev"
      + monitoring                           = false
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "App"  = "grafana-loki"
          + "Name" = "grafana-loki01-dev"
          + "Type" = "t2.micro"
        }
      + tags_all                             = {
          + "App"       = "grafana-loki"
          + "Env"       = "dev"
          + "ManagedBy" = "Terraform"
          + "Name"      = "grafana-loki01-dev"
          + "Type"      = "t2.micro"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "7c72b00075a10dff241fd138d3c0f2424469bd5b"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + volume_tags                          = {
          + "Name" = "grafana-loki01-dev"
        }
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      + credit_specification {}

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + maintenance_options {
          + auto_recovery = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_put_response_hop_limit = 1
          + http_tokens                 = "optional"
          + instance_metadata_tags      = "disabled"
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + private_dns_name_options {
          + enable_resource_name_dns_a_record    = (known after apply)
          + enable_resource_name_dns_aaaa_record = (known after apply)
          + hostname_type                        = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + timeouts {}
    }

  # module.us-east-1.module.platform.module.grafana_loki.module.ec2-instance02.aws_instance.this[0] will be created
  + resource "aws_instance" "this" {
      + ami                                  = "ami-0cabc39acf991f4f1"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = "us-east-1c"
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "terraform-aws-dev"
      + monitoring                           = false
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "App"  = "grafana-loki"
          + "Name" = "grafana-loki02-dev"
          + "Type" = "t2.micro"
        }
      + tags_all                             = {
          + "App"       = "grafana-loki"
          + "Env"       = "dev"
          + "ManagedBy" = "Terraform"
          + "Name"      = "grafana-loki02-dev"
          + "Type"      = "t2.micro"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "518ca373c1c5dd9fddbf599bfda21ddd31d994b6"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + volume_tags                          = {
          + "Name" = "grafana-loki02-dev"
        }
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      + credit_specification {}

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + maintenance_options {
          + auto_recovery = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_put_response_hop_limit = 1
          + http_tokens                 = "optional"
          + instance_metadata_tags      = "disabled"
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + private_dns_name_options {
          + enable_resource_name_dns_a_record    = (known after apply)
          + enable_resource_name_dns_aaaa_record = (known after apply)
          + hostname_type                        = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + timeouts {}
    }

  # module.us-east-1.module.platform.module.grafana_dashboards.module.grafana_rds.module.db_instance.aws_db_instance.this[0] will be created
  + resource "aws_db_instance" "this" {
      + address                               = (known after apply)
      + allocated_storage                     = 10
      + allow_major_version_upgrade           = false
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = (known after apply)
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_name                               = "grafana"
      + db_subnet_group_name                  = "vpc-us-east-1-dev"
      + delete_automated_backups              = true
      + deletion_protection                   = false
      + endpoint                              = (known after apply)
      + engine                                = "postgres"
      + engine_version                        = "14.1"
      + engine_version_actual                 = (known after apply)
      + final_snapshot_identifier             = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + iam_database_authentication_enabled   = false
      + id                                    = (known after apply)
      + identifier                            = "grafana-rds-dev"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t3.micro"
      + iops                                  = 0
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + maintenance_window                    = (known after apply)
      + max_allocated_storage                 = 20
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = false
      + name                                  = (known after apply)
      + nchar_character_set_name              = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = (known after apply)
      + password                              = (sensitive value)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = 5432
      + publicly_accessible                   = false
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = false
      + snapshot_identifier                   = "final-grafana-rds-dev-fa17a031"
      + status                                = (known after apply)
      + storage_encrypted                     = false
      + storage_type                          = (known after apply)
      + tags_all                              = {
          + "Env"       = "dev"
          + "ManagedBy" = "Terraform"
        }
      + timezone                              = (known after apply)
      + username                              = "grafana_usr"
      + vpc_security_group_ids                = (known after apply)

      + timeouts {}
    }

  # module.us-east-1.module.platform.module.grafana_dashboards.module.grafana_rds.module.db_instance.random_id.snapshot_identifier[0] will be created
  + resource "random_id" "snapshot_identifier" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = {
          + "id" = "grafana-rds-dev"
        }
    }

  # module.us-east-1.module.platform.module.grafana_dashboards.module.grafana_rds.module.db_parameter_group.aws_db_parameter_group.this[0] will be created
  + resource "aws_db_parameter_group" "this" {
      + arn         = (known after apply)
      + description = "grafana-rds-dev parameter group"
      + family      = "postgres14"
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "grafana-rds-dev-"
      + tags        = {
          + "Name" = "grafana-rds-dev"
        }
      + tags_all    = {
          + "Env"       = "dev"
          + "ManagedBy" = "Terraform"
          + "Name"      = "grafana-rds-dev"
        }
    }

Plan: 97 to add, 0 to change, 0 to destroy.

Warning: Reference to undefined provider

  on main.tf line 23, in module "us-east-1":
  23:     aws = aws.use1

There is no explicit declaration for local provider name "aws" in
module.us-east-1, so Terraform is assuming you mean to pass a configuration
for "hashicorp/aws".

If you also control the child module, add a required_providers entry named
"aws" with the source address "hashicorp/aws".

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @kaio6fellipe, Action: `pull_request`*